УТ/src/InformationRegisters/CRM_ЛогиСобытийiCRM/CRM_ЛогиСобытийiCRM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЛогиСобытийiCRM</name>
  <resources>
    <name>ОписаниеСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.CRM_ТипыСобытийЛогаiCRM</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.CRM_СинхронизацияСМобильнымПриложениемНовый</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/CRM_ЛогиСобытийiCRM/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет запись события в регистр.
//
// Параметры:
//  ОписаниеСобытия	 - Строка	 - Описание события.
//  ТипСобытия		 - ПеречислениеСсылка.CRM_ТипыСобытийЛогаiCRM, Неопределено	 - Тип события.
//  УзелОбмена		 - ПланОбменаСсылка.CRM_СинхронизацияСМобильнымПриложениемНовый - Узел плана обмена.
//
Процедура ЗаписатьСобытие(ОписаниеСобытия = "", ТипСобытия = Неопределено, УзелОбмена) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.CRM_ЛогиСобытийiCRM.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторСобытия = Новый УникальныйИдентификатор;
	Запись.ТипСобытия = ТипСобытия;
	Запись.ОписаниеСобытия = ОписаниеСобытия;
	Запись.УзелОбмена = УзелОбмена;
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
